app/controllers/wells_controller.rb

SELECT "wells".* FROM "wells"
---
	def index
		@wells = Well.all

INSERT INTO "wells" ("name", "start_date", "end_date", "total_depth", "created_at", "updated_at", "well_number") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@well = Well.create!(well_params)

UPDATE "wells" SET "name" = $1, "updated_at" = $2 WHERE "wells"."id" = $3  [["name", "Shopping"], ["updated_at", 2017-04-30 02:04:48 UTC], ["id", 103]]
---
	def update
		@well.update(well_params)

DELETE FROM "wells" WHERE "wells"."id" = $1  [["id", 123]]
---
	def destroy
		@well.destroy

SELECT  "wells".* FROM "wells" WHERE "wells"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
---
		def set_well
			@well = Well.find(params[:id])